holographicSol/SatIO_ESPIDF_Waveshare_ESP32-P4_Round_Display/satio_lvgl.h
    lv_obj_t * lbl_current_twilight_zone_name;
    lv_obj_t * val_current_twilight_zone_name;

    lv_obj_t * lbl_LMST_astronomical_twilight_dawn;
    lv_obj_t * val_LMST_astronomical_twilight_dawn;

    lv_obj_t * lbl_LMST_nautical_twilight_dawn;
    lv_obj_t * val_LMST_nautical_twilight_dawn;    

    lv_obj_t * lbl_LMST_civil_twilight_dawn;
    lv_obj_t * val_LMST_civil_twilight_dawn;

    lv_obj_t * lbl_LMST_sunrise;
    lv_obj_t * val_LMST_sunrise;

    lv_obj_t * lbl_LMST_golden_hour_dawn;
    lv_obj_t * val_LMST_golden_hour_dawn;

    lv_obj_t * lbl_LMST_FullDayLight;
    lv_obj_t * val_LMST_FullDayLight;

    lv_obj_t * lbl_LMST_golden_hour_dusk;
    lv_obj_t * val_LMST_golden_hour_dusk;

    lv_obj_t * lbl_LMST_sunset;
    lv_obj_t * val_LMST_sunset;

    lv_obj_t * lbl_LMST_civil_twilight_dusk;
    lv_obj_t * val_LMST_civil_twilight_dusk;

    lv_obj_t * lbl_LMST_nautical_twilight_dusk;
    lv_obj_t * val_LMST_nautical_twilight_dusk;

    lv_obj_t * lbl_LMST_astronomical_twilight_dusk;
    lv_obj_t * val_LMST_astronomical_twilight_dusk;
    
    lv_obj_t * lbl_LMST_astronomical_night;
    lv_obj_t * val_LMST_astronomical_night;

    // lv_obj_t * lbl_LMST_current_twilight_zone_name;
    // lv_obj_t * val_LMST_current_twilight_zone_name;
    // lv_obj_t * lbl_LMST_current_twilight_zone_start_time;
    // lv_obj_t * val_LMST_current_twilight_zone_start_time;
    // lv_obj_t * lbl_LMST_current_twilight_zone_end_time;
    // lv_obj_t * val_LMST_current_twilight_zone_end_time;

} satio_container_t;

/** ---------------------------------------------------------------------------------------
 * @brief Gyro Container Struct
 */
typedef struct {
    lv_obj_t * panel;
    lv_obj_t * lbl_gyro_0_ang_x;
    lv_obj_t * val_gyro_0_ang_x;
    lv_obj_t * val_gyro_0_ang_y;
    lv_obj_t * val_gyro_0_ang_z;
    lv_obj_t * lbl_gyro_0_acc_x;
    lv_obj_t * val_gyro_0_acc_x;
    lv_obj_t * val_gyro_0_acc_y;
    lv_obj_t * val_gyro_0_acc_z;
    lv_obj_t * lbl_gyro_0_gyr_x;
    lv_obj_t * val_gyro_0_gyr_x;
    lv_obj_t * val_gyro_0_gyr_y;
    lv_obj_t * val_gyro_0_gyr_z;
    lv_obj_t * lbl_gyro_0_mag_x;
    lv_obj_t * val_gyro_0_mag_x;
    lv_obj_t * val_gyro_0_mag_y;
    lv_obj_t * val_gyro_0_mag_z;
    lv_obj_t * lbl_gyro_0_current_uiBaud;
    lv_obj_t * val_gyro_0_current_uiBaud;
} gyro_0_container_t;

/** ---------------------------------------------------------------------------------------
 * @brief Serial Container Struct
 */
typedef struct {
    lv_obj_t * panel;

    lv_obj_t * lbl_title_output_all;
    lv_obj_t * lbl_title_output_gps;
    lv_obj_t * lbl_title_output_gyro;
    lv_obj_t * lbl_title_output_aux;
    lv_obj_t * lbl_title_output_uni;

    lv_obj_t * lbl_output_all;
    lv_obj_t * sw_output_all;

    lv_obj_t * lbl_output_satio;
    lv_obj_t * sw_output_satio;
    lv_obj_t * lbl_output_gngga;
    lv_obj_t * sw_output_gngga;
    lv_obj_t * lbl_output_gnrmc;
    lv_obj_t * sw_output_gnrmc;
    lv_obj_t * lbl_output_gpatt;
    lv_obj_t * sw_output_gpatt;
    lv_obj_t * lbl_output_ins;
    lv_obj_t * sw_output_ins;

    lv_obj_t * lbl_output_gyro_0;
    lv_obj_t * sw_output_gyro_0;

    lv_obj_t * lbl_output_matrix;
    lv_obj_t * sw_output_matrix;
    lv_obj_t * lbl_output_input_controller;
    lv_obj_t * sw_output_input_controller;
    lv_obj_t * lbl_output_admplex_0;
    lv_obj_t * sw_output_admplex_0;
    lv_obj_t * lbl_output_admplex_1;
    lv_obj_t * sw_output_admplex_1;

    lv_obj_t * lbl_output_sun;
    lv_obj_t * sw_output_sun;
    lv_obj_t * lbl_output_mercury;
    lv_obj_t * sw_output_mercury;
    lv_obj_t * lbl_output_venus;
    lv_obj_t * sw_output_venus;
    lv_obj_t * lbl_output_earth;
    lv_obj_t * sw_output_earth;
    lv_obj_t * lbl_output_luna;
    lv_obj_t * sw_output_luna;
    lv_obj_t * lbl_output_mars;
    lv_obj_t * sw_output_mars;
    lv_obj_t * lbl_output_jupiter;
    lv_obj_t * sw_output_jupiter;
    lv_obj_t * lbl_output_saturn;
    lv_obj_t * sw_output_saturn;
    lv_obj_t * lbl_output_uranus;
    lv_obj_t * sw_output_uranus;
    lv_obj_t * lbl_output_neptune;
    lv_obj_t * sw_output_neptune;
    lv_obj_t * lbl_output_meteors;
    lv_obj_t * sw_output_meteors;
} serial_container_t;

/** ---------------------------------------------------------------------------------------
 * @brief Analog/Digital Multiplexer Container Struct
 */
typedef struct {
    lv_obj_t * panel;

    lv_obj_t * lbl_title_admplex_1;

    /* Per-channel name/data (index == channel number). */
    lv_obj_t * lbl_title_chan[MAX_ANALOG_DIGITAL_MULTIPLEXER_CHANNELS];
    lv_obj_t * lbl_val_chan[MAX_ANALOG_DIGITAL_MULTIPLEXER_CHANNELS];
    lv_obj_t * lbl_title_chan1[MAX_ANALOG_DIGITAL_MULTIPLEXER_CHANNELS];
    lv_obj_t * lbl_val_chan1[MAX_ANALOG_DIGITAL_MULTIPLEXER_CHANNELS];

    /* Per-channel enable/disable switches (index == channel number). */
    lv_obj_t * sw_chan_enabled[MAX_ANALOG_DIGITAL_MULTIPLEXER_CHANNELS];
    lv_obj_t * sw_chan1_enabled[MAX_ANALOG_DIGITAL_MULTIPLEXER_CHANNELS];

    /* Per-channel configured read rate; clickable to edit via keyboard. */
    lv_obj_t * lbl_freq_chan[MAX_ANALOG_DIGITAL_MULTIPLEXER_CHANNELS];
    lv_obj_t * lbl_freq_chan1[MAX_ANALOG_DIGITAL_MULTIPLEXER_CHANNELS];

    /* Per-channel achieved read rate out of the configured rate, read-only. */
    lv_obj_t * lbl_rate_chan[MAX_ANALOG_DIGITAL_MULTIPLEXER_CHANNELS];
    lv_obj_t * lbl_rate_chan1[MAX_ANALOG_DIGITAL_MULTIPLEXER_CHANNELS];

} admplex0_container_t;

/** ---------------------------------------------------------------------------------------
 * UAP Struct
 */
typedef struct {
    lv_obj_t * panel;

    lv_obj_t * roll_panel;

    lv_obj_t * pitch_panel;
    int32_t pitch_panel_height_px;
    int32_t pitch_panel_width_px;

    lv_obj_t * yaw_panel;
    int32_t yaw_panel_width_px;
    int32_t yaw_panel_height_px;

    lv_obj_t * gyro_angle_x_label;
    lv_obj_t * gyro_angle_y_label;
    lv_obj_t * gyro_angle_z_label;

